// Task 2_7
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

console.log('----------Task_2_7----------');
console.log('(узгоджено з замовником, що числа 15, 30, 45, 60 будуть належати наступній чверті)');

let time = +prompt('Введіть число від 0 до 59');

if (time >= 0 && time < 15 || time ===60 ){
    console.log(`Число ${time} знаходиться в І чверті години`)
}else if (time >= 15 && time < 30){
    console.log(`Число ${time} знаходиться в ІI чверті години`)
}else if (time >= 30 && time < 45){
    console.log(`Число ${time} знаходиться в ІII чверті години`)
}else if (time >= 45 && time < 59){
    console.log(`Число ${time} знаходиться в ІV чверті години`)
}else {
    console.log(`Ваше число ${time} не належить діапазону від 0 до 59`)
}


