console.log(`----------add_5_1----------`);
console.log(`----------створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і b----------`);

let square = (a, b) => a * b;

let squareRect = square(4, 9);

console.log(`Площа прямокутника дорівнює ${squareRect}`);


//**********************************************************************************************************


console.log(`----------add_5_2----------`);
console.log(`----------створити функцію яка обчислює та повертає площу кола з радіусом r----------`);

let square_2 = (r) => Math.PI * r**2;

let squareСircle = square_2(5);
console.log(`Площа кола ${squareСircle.toFixed(2)}`);


//**********************************************************************************************************


console.log(`----------add_5_3----------`);
console.log(`----------створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r----------`);

let square_3 = (h, r_2) => 2 * Math.PI * r_2 * (h + r_2);

let squareCylinder = square_3(15, 8);

console.log(`Площа циліндру дорівнює ${squareCylinder.toFixed(2)}`);


//**********************************************************************************************************


console.log(`----------add_5_4----------`);
console.log(`----------створити функцію яка приймає масив та виводить кожен його елемент----------`);

let printElemArr = (arr) => {
    for (let i = 0; i <arr.length; i++) {
        console.log(arr[i]);
    }
}

let arr = [13, 'stepan', true, 'oleksa', null, 88, {name: 'okten', age: 12}];

let print = printElemArr(arr);
