// add_1_4
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//

console.log('----------add_1_4----------');

console.log('----------перебрати циклом while та вивести  числа тільки з непарним індексом---------');


//     add_1_5
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
//
//     add_1_6
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//     add_1_7
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//
// add_1_8
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//
// add_1_9
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// add_1_10
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//
//     add_1_11
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//
// add_1_12
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//
// add_1_13
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//
// add_1_14
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//
// add_1_15
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
