// Task_3_3
// За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

console.log('----------Task_3_3----------');
console.log('За допомогою циклу while вивести в документ 20 блоків h1 з довільним текстом всередині.');

document.write(`<h2>Task_3_3. Циклом while 20 блоків h1 з довільним текстом всередині</h2>`);
document.write(`<h4>Ментор Діана на курсі HTML навчала, щоб ми уникали від використання кількох елементів h1, тому узгоджено з замовником: h1 змінюємо на h2.</h4>`);
let i = 0;
while (i < 20){
    console.log(`елемент ${i + 1}`);

    document.write(`<div class="block">
                        <h2> Я номер ${i + 1}</h2>
                    </div>`);
    i++;
}
